Repository: 84000/data-translation-memory
Catalog: Toh_157-The_Questions_of_the_Kimnara_King_Druma-v2.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་ཁམས་སྣ་ཚོགས་ལ་ཡང་རྣམ་པར་ལྟ་ལ་ཆོས་ཀྱི་དབྱིངས་ལས་ཀྱང་མི་གཡོའོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will attend to the various elements without parting from the realm of phenomena.

source: སེམས་ཅན་རང་བཞིན་མེད་པས་ཆོས་རང་བཞིན་མེད་པར་རྟོག་པ་དང་། ཆོས་རང་བཞིན་མེད་པས་སེམས་ཅན་རང་བཞིན་མེད་པར་རྟོག་པ་དང་། སེམས་ཅན་རང་བཞིན་མེད་པས་སངས་རྒྱས་ཀྱི་ཆོས་རང་བཞིན་མེད་པར་མོས་པ་དང་། སེམས་ཅན་རང་བཞིན་མེད་པ་ལ་སོམ་ཉི་མེད་ཅིང་ཐེ་ཙོམ་དང་བྲལ་བ་ཡིན་ཏེ
en: They are (1) understanding that phenomena lack intrinsic existence since sentient beings lack intrinsic existence, (2) understanding that sentient beings lack intrinsic existence since phenomena lack intrinsic existence, (3) being confident that buddha qualities lack intrinsic existence since sentient beings lack intrinsic existence, and (4) being free from doubts and hesitation about the fact that sentient beings lack intrinsic existence.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་ཁམས་སྣ་ཚོགས་ལ་ཡང་རྣམ་པར་ལྟ་ལ་ཆོས་ཀྱི་དབྱིངས་ལས་ཀྱང་མི་གཡོའོ། །
en: Noble son, if bodhisattvas possess those four qualities, they will attend to the various elements without parting from the realm of phenomena.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་དོན་ཡང་མི་འདོར་ལ་གནོད་པར་ཡང་ཀུན་དུ་སྣང་ངོ་། །
en: “Noble son, if bodhisattvas possess four qualities, they will not give up being of benefit even when they appear to be engaging in harmful actions.

source: བསམ་པ་མྱ་ངན་ལས་འདས་པར་སོང་བ་རྣམས་ཡིན།
en: They are (1) having their thoughts directed toward nirvāṇa,

source: སྦྱོར་བ་འཁོར་བར་སོང་བ་རྣམས་ཡིན།
en: (2) having their deeds directed toward saṃsāra,

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་བསྐང་བ་ལ་བསམ་པ་སོང་བ་རྣམས་ཡིན།
en: (3) having their minds directed toward the perfection of all buddha qualities, and

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཡུལ་ལ་ཡང་ཀུན་ཏུ་སྣང་བ་རྣམས་ཡིན་ཏེ།
en: (4) manifesting in the domains of the hearers and solitary buddhas.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་དོན་ཡང་མི་འདོར་ལ་གནོད་པར་ཡང་ཀུན་དུ་སྣང་ངོ་། །
en: Noble son, if bodhisattvas possess those four qualities, they will not give up being of benefit even when they appear to be engaging in harmful actions.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་བསོད་ནམས་ཀྱིས་ནོར་དང་ལྡན་ལ་ཐབས་ཀྱིས་ནོར་མེད་པ་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will possess wealth due to merit and be without wealth due to skillful means.

source: རྒྱ་ཆེན་པོ་ལ་མོས་པའི་སེམས་ཅན་འདུལ་བའི་ཕྱིར་བསོད་ནམས་ཀྱིས་འཁོར་ལོས་སྒྱུར་བ་དང་། བརྒྱ་བྱིན་དང་ཚངས་པའི་བསོད་ནམས་ཀྱང་ཉེ་བར་སྟོན་པ་དང་། འགྲོ་བ་ཕལ་པ་འདུལ་བའི་ཕྱིར་དབུལ་ཞིང་དམན་པར་ཡང་ཉེ་བར་སྟོན་པ་དང་། སློང་བ་མཐོང་ན་བདོག་པ་ཐམས་ཅད་གཏོང་ཞིང་། ནོར་མེད་པར་ཡང་འགྱུར་བ་དང་། ནོར་ཆེན་པོ་དང་ལྡན་པ་མཐོང་ན་བསོད་ནམས་ཀྱིས་ལོངས་སྤྱོད་ཟད་མི་ཤེས་པར་ཡང་ཉེ་བར་སྟོན་པ་སྟེ།
en: They are (1) manifesting as universal monarchs due to their merit, or as Śakra, or Brahmā, in order to tame beings that are attracted to greatness, (2) manifesting as destitute and lowly beings to tame ordinary beings, (3) giving away all of their possessions upon seeing beggars and thus becoming poor, and (4) manifesting an inexhaustible amount of wealth through their merit upon seeing someone very rich.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་བསོད་ནམས་ཀྱིས་ནོར་དང་ལྡན་པ་ཡིན་ལ། ཐབས་ཀྱིས་ནོར་མེད་པ་རྣམས་ཡིན་ནོ། །
en: Noble son, if bodhisattvas possess those four qualities, they will possess wealth due to merit and be without wealth due to skillful means.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་ཨ་ཞེས་བྱ་བའི་སྒོས་རྣམ་པ་མེད་པའི་སྒོ་ལ་འཇུག་པ་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will enter the gate without attributes through the gateway of the syllable a .

source: འདུ་བྱེད་ཐམས་ཅད་མི་རྟག་པར་ཤེས་པ་སྦྱོང་བ་དང་། འདུ་བྱེད་ཐམས་ཅད་གཟོད་མ་ནས་སྡུག་བསྔལ་ལོ་ཞེས་བྱང་ཆུབ་རབ་ཏུ་རྙེད་པ་དང་། ཆོས་ཐམས་ཅད་བདག་མེད་དོ་ཞེས་ལྟ་བར་གྱུར་པ་ཡོངས་སུ་སྦྱོང་བ་དང་། མྱ་ངན་ལས་འདས་པ་ནི་གཟོད་མ་ནས་ཞི་བ་ཞེས་ཡེ་ཤེས་ལ་འཇུག་པ་སྟེ།
en: They are (1) refining the understanding that ‘all formations are impermanent,’ (2) having reached the understanding that ‘all formations have always been suffering,’ (3) refining the view that ‘all phenomena are selfless,’ and (4) gaining the wisdom that ‘nirvāṇa has always been peaceful.’

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན། ཨ་ཞེས་བྱ་བའི་སྒོས་རྣམ་པ་མེད་པའི་སྒོ་ལ་འཇུག་པ་རྣམས་ཡིན་ནོ། །
en: Noble son, if bodhisattvas possess those four qualities, they will enter the gate without attributes through the gateway of the syllable a.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་མངོན་སུམ་དུ་འགྱུར་བ་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will actualize all buddha qualities.

source: ཤེས་རབ་ཀྱི་མིག་ཤིན་ཏུ་རྣམ་པར་དག་པ་རྣམས་ཡིན།
en: They are (1) possessing the pure eye of insight,

source: ཆོས་ཀྱི་མིག་གིས་སྣང་བ་ཐོབ་པ་རྣམས་ཡིན།
en: (2) having obtained illumination through the Dharma eye,

source: སངས་རྒྱས་ཀྱི་སྤྱན་མངོན་སུམ་དུ་གྱུར་པ་རྣམས་ཡིན།
en: (3) having actualized the buddha eye, and

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་དབང་བསྐུར་བ་ཐོབ་པ་རྣམས་ཡིན་ཏེ།
en: (4) having been consecrated into all buddha qualities.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་མངོན་སུམ་དུ་འགྱུར་བ་རྣམས་ཡིན་ནོ། །
en: Noble son, if bodhisattvas possess those four qualities, they will actualize all buddha qualities.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན། ཆོས་རྣམ་པར་གདོན་མི་ཟ་བ་རྣམས་ལ་རྣམ་པར་ཕྱེ་བ་ཤིན་ཏུ་རྣམ་པར་འབྱེད་པ་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will gain certainty about the Dharma and discern its distinctions.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་ཤེས་པ་སྒྲིབ་པ་མེད་པ་དང་། བདེན་པ་བཞི་རྣམ་པར་དགོད་པ་ཤེས་པ་དང་། རྟོན་པ་ལ་གནས་སུ་ཤེས་པ་དང་། གཟུངས་ལ་གཡེང་བ་མེད་པར་ཤེས་པ་སྟེ།
en: They are (1) being unobscured with respect to the four correct knowledges, (2) understanding how to set forth the four truths, (3) understanding that the reliances are valid, and (4) knowing recollection free from distraction.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་ཆོས་རྣམ་པར་གདོན་མི་ཟ་བ་རྣམས་ལ་རྣམ་པར་ཕྱེ་བ་ཤིན་ཏུ་རྣམ་པར་འབྱེད་པ་རྣམས་ཡིན་ནོ། །
en: Noble son, if bodhisattvas possess those four qualities, they will gain certainty about the Dharma and discern its distinctions.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་འཇིག་རྟེན་གྱི་བྱ་བ་དང་། འཐུན་པར་ཞུགས་ཀྱང་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་མི་གོས་པ་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will act in accord with the world while remaining untainted by afflictions.

source: འཇིག་རྟེན་གྱི་ཆོས་མངོན་སུམ་དུ་གྱུར་པ་དང་། འཇིག་རྟེན་ལས་སེམས་ཅན་ཡང་དག་པར་སྒྲོལ་བ་དང་། རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་སྤོང་བ་དང་། གཟོད་མ་ནས་རྣམ་པར་དག་ཅིང་འོད་གསལ་བས་ཀྱང་རང་བཞིན་གྱིས་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་ཡིན་ཏེ
en: They are (1) directly perceiving mundane phenomena, (2) liberating beings from the world, (3) abandoning attachment and aggression, and (4) being naturally devoid of afflictions by virtue of their original purity and luminosity.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་འཇིག་རྟེན་གྱི་བྱ་བ་དང་འཐུན་པར་ཞུགས་ཀྱང་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་མི་གོས་པ་རྣམས་ཡིན་ནོ། །
en: Noble son, if bodhisattvas possess those four qualities, they will act in accord with the world while remaining untainted by all its afflictions.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་གཞན་དག་གིས་བལྟར་མི་མཐོང་བའི་ཆོས་ཀྱི་དབང་ཕྱུག་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will possess the might of the Dharma that is invisible to others.

source: སེམས་ཀྱི་དབང་ཕྱུག་དང་། ཤེས་རབ་ཀྱི་དབང་ཕྱུག་དང་། ཡེ་ཤེས་ཀྱི་དབང་ཕྱུག་དང་། ཐབས་ཀྱི་དབང་ཕྱུག་སྟེ།
en: They are (1) the might of the mind, (2) the might of insight, (3) the might of wisdom, and (4) the might of methods.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་གཞན་དག་གིས་བལྟར་མི་མཐོང་བའི་ཆོས་ཀྱི་དབང་ཕྱུག་རྣམས་ཡིན་ནོ། །
en: Noble son, if bodhisattvas possess those four qualities, they will possess the might of the Dharma that is invisible to others.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན། དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དང་མི་འབྲལ་བ་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will never be without meeting the thus-gone ones.

source: སེམས་ཅན་རྣམས་སངས་རྒྱས་མཐོང་བ་ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་དང་། སེམས་ཅན་རྣམས་ཆོས་ཉན་པ་ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་དང་། སེམས་ཅན་རྣམས་བྱང་ཆུབ་ཀྱི་སེམས་ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་དང་། སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་ཏིང་ངེ་འཛིན་དང་མི་འབྲལ་བ་ཡིན་ཏེ
en: They are (1) encouraging sentient beings to meet the buddhas, (2) encouraging sentient beings to listen to the Dharma, (3) encouraging sentient beings to arouse the mind set on awakening, and (4) never parting from the absorption in which one calls to mind the buddhas.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དང་མི་འབྲལ་བ་རྣམས་ཡིན་ནོ། །
en: Noble son, if bodhisattvas possess those four qualities, they will never be without meeting the thus-gone ones.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་ཤིན་ཏུ་དུལ་ཞིང་མི་འཁྲུགས་པའི་ཆོས་ཅན་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will remain composed and undisturbed.

source: འཕགས་པ་འཇིག་རྟེན་ལས་འདས་པའི་ཤེས་རབ་ཀྱིས་རྣམ་པར་གྲོལ་བ་ཡེ་ཤེས་མཐོང་བ་མངོན་སུམ་དུ་གྱུར་པ་དང་། བདེན་པ་ལ་ཉེ་བར་བརྟགས་པས་ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་པ་དང་། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་ཡང་དག་པར་གཅོད་པ་ལ་མཁས་པར་གྱུར་པ་དང་། ཉོན་མོངས་པས་མི་འཁྲུགས་པའི་ཆོས་ཅན་ཏེ།
en: They are (1) having actualized the vision of liberated wisdom through the noble supramundane insight, (2) knowing all phenomena as they truly are by thoroughly investigating the truth, (3) being skilled in severing all the fetters of habitual tendencies, and (4) not being disturbed by afflictions.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་ཆོས་རྣམས་བླངས་པ་མེད་པར་སློབ་དཔོན་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will be teachers without grasping at the teachings.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་དངོས་པོ་ཕུན་སུམ་ཚོགས་པ་རྣམས་ཡིན།
en: They are (1) providing excellent beneficial things to all beings,

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་བརྟན་ཞིང་བསམ་པ་སྒྱུ་མེད་པ་རྣམས་ཡིན།
en: (2) ripening beings in a constant and undeceiving manner,

source: བདག་གིས་བདེ་བ་ལ་མི་ཆགས་པ་རྣམས་ཡིན།
en: (3) not being attached to their own happiness, and

source: གང་ཡེ་ཤེས་ཡོངས་སུ་ཚོལ་བ་དེ་ཡང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཆེད་དུ་ཡིན་གྱི་བདག་འབའ་ཞིག་གི་ཕྱིར་མ་ཡིན་པ་སྟེ།
en: (4) pursuing wisdom for the sake of all beings—not for themselves alone.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་ཆོས་རྣམས་བླངས་པ་མེད་པར་སློབ་དཔོན་རྣམས་ཡིན་ནོ། །
en: Noble son, if bodhisattvas possess those four qualities, they will be teachers without grasping at the teachings.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྟོན་པར་གྱུར་པ་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will be the teachers of all beings.

source: བདག་གི་དོན་གཏོང་ཞིང་གཞན་གྱི་དོན་བྱེད་པ་རྣམས་ཡིན།
en: They are (1) accomplishing the benefit of others while disregarding their own benefit,

source: བདག་གི་བདེ་བ་ཐམས་ཅད་གཏོང་ཞིང་། སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱི་བདེ་བ་སྦྱིན་པ་རྣམས་ཡིན།
en: (2) giving the joy of the Dharma to others while disregarding their own happiness,

source: ཇི་ལྟར་ཐོས་པའི་ཆོས་སྟོན་པ་ལ་ངལ་བ་མེད་པ་རྣམས་ཡིན།
en: (3) untiringly teaching the Dharma just as they have heard it, and

source: ཆོས་ཀྱི་འཚོ་བས་འཚོའི་ཟང་ཟིང་གིས་འཚོ་བ་མ་ཡིན་པ་སྟེ།
en: (4) sustaining themselves with the nourishment of the Dharma—not with material goods.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྟོན་པར་གྱུར་པ་རྣམས་ཡིན་ནོ། །
en: Noble son, if bodhisattvas possess those four qualities, they will be the teachers of all beings.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་རྗེས་སུ་བསྐོར་བ་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will turn the Dharma wheel of all the buddhas.

source: གཟུངས་རབ་ཏུ་ཐོབ་པ་དང་། སྤོབས་པ་རྒྱུན་མི་འཆད་པ་དང་། སེམས་ཅན་གྱི་བསམ་པ་ཤེས་པ་ལ་འཇུག་པ་དང་། མྱ་ངན་ལས་འདས་པའི་ལམ་དུ་ཁྲིད་ཅིང་མི་ཕྱེད་པའི་ཆོས་སྟོན་པ་ཡིན་ཏེ
en: They are (1) the ability of perfect recall, (2) possessing uninterrupted eloquence, (3) having knowledge of all beings’ thoughts, and (4) leading them on the path to nirvāṇa while teaching the indestructible Dharma.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་རྗེས་སུ་བསྐོར་བ་རྣམས་ཡིན་ནོ། །
en: Noble son, if bodhisattvas possess those four qualities, they will turn the Dharma wheel of all the buddhas.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་དབང་བསྐུར་བ་ཐོབ་པ་རྣམས་ཡིན་ནོ། །
en: “Noble son, if bodhisattvas possess four qualities, they will obtain consecration into all buddha qualities.

source: སྤྱོད་པ་ཐམས་ཅད་ལས་རབ་ཏུ་འདས་པ་རྣམས་ཡིན།
en: They are (1) having completely transcended all forms of conduct,

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལས་མི་ལྡོག་ཅིང་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་རྣམས་ཡིན།
en: (2) having reached acceptance of the unborn nature of phenomena and never regressing from bodhisattva conduct,

source: བསམས་བཞིན་དུ་ཚེ་དང་། འཆི་འཕོ་དང་། སྐྱེ་བ་ཡང་སྟོན་ལ་ཕྱིར་མི་ལྡོག་པའི་ཕྱག་རྒྱས་ཀྱང་བཏབ་པ་རྣམས་ཡིན།
en: (3) intentionally displaying life, death, and rebirth while being marked by the seal of irreversibility, and

source: དེ་བཞིན་གཤེགས་པའི་ཕྱག་རྒྱ་ལ་ཡང་དག་པར་གཞོལ་ཞིང་ས་བཅུར་ངེས་པར་བྱུང་ན། ས་ནས་སར་འཕར་བ་ལ་མཁས་པ་ཡིན་ཏེ།
en: (4) dedicating themselves to the seal of the thus-gone ones and being skilled in progressing from one bodhisattva level to the next after reaching emancipation on the ten bodhisattva levels.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་འདི་བཞི་དང་ལྡན་ན། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་དབང་བསྐུར་བ་ཐོབ་པ་རྣམས་ཡིན་ནོ། །
en: Noble son, if bodhisattvas possess those four qualities, they will obtain consecration into all buddha qualities.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཞི་པ་བསྒྲུབ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན།
en: When the Blessed One had explained this Dharma teaching on fourfold accomplishments,

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་ནས་སྣང་བ་ཆེན་པོས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་ཁྱབ་པར་གྱུར་ཏོ། །
en: this great trichiliocosm shook in six ways, a bright light pervaded the universe, and

source: སྟེང་གི་བར་སྣང་ལས་ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གིས་ལྷའི་གླུ་དབྱངས་བླངས་ཏེ།
en: billions of gods living in the sky started to sing divine songs.

source: ལྷའི་མེ་ཏོག་མན་དཱ་ར་བའི་ཆར་རབ་ཏུ་ཕབ་ནས་འདི་སྐད་ཅེས་ཀྱེ་མའོ་བཅོམ་ལྡན་འདས་ཀྱིས་འདིར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བཞི་པ་བསྒྲུབ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་བསྟན་པ་འདི་ནི་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་གྲངས་མེད་པ་ནས་བསྒྲུབས་པ་ལགས་སོ། །
en: They caused a rain of divine mandārava flowers to fall and exclaimed, “Oh! The unsurpassed and perfect awakening of the blessed buddhas that has been described in this Dharma teaching on fourfold accomplishments was achieved countless billions of eons ago by the Blessed One!

source: བཅོམ་ལྡན་འདས་གང་བཞི་པ་སྒྲུབ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉན་པ་དང་། མཉན་ནས་མོས་པ་དང་། མོས་ནས་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། གཞན་དག་ལ་ཡང་སྟོན་པ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་དང་མི་འབྲལ་བའི་སེམས་ཅན་དེ་དག་ནི། དགེ་བའི་རྩ་བ་ངན་ངོན་དང་ལྡན་པ་མ་ལགས་ཏེ།
en: Blessed One, those sentient beings who hear this Dharma teaching on fourfold accomplishments, develop interest upon hearing it, and then retain it, carry it, read it, comprehend it, and teach it to others without parting from the mind of awakening will not be endowed with trifling roots of virtue.

source: དེ་དག་ནི་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ད་ལྟར་སེང་གེའི་སྒྲ་སྒྲོག་པ་བཞིན་དུ་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་གྱི་འཇིག་རྟེན་གྱི་མདུན་དུ་སེང་གེའི་སྒྲ་སྒྲོག་པར་འགྱུར་རོ། །
en: Just as the Thus-Gone One, the worthy one, the perfect Buddha proclaimed the lion’s roar today, they will proclaim the lion’s roar within the worlds of gods, humans, and demigods.

source: བཅོམ་ལྡན་འདས་བདག་ཅག་ཀྱང་བཞི་པ་བསྒྲུབ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་པས་རྙེད་པ་ལེགས་པར་རྙེད་དོ། །
en: Blessed One, we are very fortunate to have heard this Dharma teaching on fourfold accomplishments!”

source: ལྷ་དང་མིའི་སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་ནི། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཁྲི་ཉིས་སྟོང་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: eighty-four thousand gods and humans gave rise to the mind set on unsurpassed and perfect awakening, and twelve thousand bodhisattvas reached acceptance of the unborn nature of phenomena.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷའི་ཅོད་པན་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then, the bodhisattva great being Divyamauli asked the Blessed One,

source: བཅོམ་ལྡན་འདས་གང་དག་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་མདོ་སྡེ་འདི་ལྟ་བུ་འདི་འཛིན་པ་དང་། གཞན་དག་ལ་རྒྱ་ཆེར་རབ་ཏུ་སྟོན་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཆོས་དུ་དང་ལྡན་པར་འགྱུར།
en: “Blessed One, what are the qualities that will be possessed by the bodhisattvas who retain a sūtra like this one after the Thus-Gone One’s passing, and who teach it at length to others?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: replied the Blessed One,

source: རིགས་ཀྱི་བུ་གང་དག་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་མདོ་སྡེ་འདི་ལྟ་བུ་འདི་འཛིན་པ་དང་། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་སྟོན་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ནི་ཆོས་བརྒྱད་དང་ལྡན་པར་འགྱུར་རོ། །
en: “Noble son,” “the bodhisattvas who retain such a sūtra after the Thus-Gone One’s passing, and who teach it in a vast way to others, will possess eight qualities.

source: བརྒྱད་གང་ཞེ་ན།
en: What are those eight?

source: དེ་དག་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བསམ་པ་ངེས་ཏེ། བསམ་པ་ཕུན་སུམ་ཚོགས་པར་འགྱུར་བ་དང་།
en: (1) Their intent with respect to perfect awakening will be definitive—they will possess a perfect attitude.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཞེ་སྡང་བའི་སེམས་མེད་དེ། ཤིན་ཏུ་བྱམས་པ་བསྒོམ་པ་བསྒོམས་པར་འགྱུར་བ་དང་།
en: (2) They will be devoid of anger toward any being—they will cultivate the practice of great love.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་གནས་ཏེ། སྙིང་རྗེ་ཆེན་པོ་ལ་གནས་པར་འགྱུར་བ་དང་།
en: (3) They will abide by the activity of ripening beings—they will abide by great compassion.

source: ཆོས་འདོད་དེ་ཆོས་དོན་དུ་གཉེར་བར་འགྱུར་བ་དང་། ཐོས་པ་ཚོལ་བས་མི་ངོམས་ཏེ་མཚོ་ཆེན་རྒྱ་མཚོ་ལྟ་བུར་འགྱུར་བ་དང་།
en: (4) They will wish for the Dharma and exert themselves in its pursuit. (5) They will be insatiable in their pursuit of learning and their level of erudition will become as vast as an ocean.

source: ལུས་དང་སྲོག་འདོར་ཞིང་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པར་འགྱུར་བ་དང་། བསོད་ནམས་ཀྱི་ཚོགས་བསགས་ཏེདགེ་བའི་རྩ་བ་བརྟན་པར་འགྱུར་བ་དང་།
en: (6) They will uphold the sacred Dharma even at the cost of their bodies and lives. (7) They will gather the accumulation of merit and their roots of virtue will be firm.

source: སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་ཏེ། སྨོན་ལམ་གྱིས་ཡང་དག་པར་བྱུང་བར་འགྱུར་བ་དང་། འཁོར་གྱི་ནང་དུ་འཇིགས་པ་མེད་པས་བདུད་དང་ཕྱིར་རྒོལ་བ་བཅོམ་པར་འགྱུར་བ་སྟེ།
en: (8) They will be blessed by the power of the buddhas such that they become perfected in their aspirations, and, within the entourage, they will know no fear and they will defeat all demons and opponents.

source: རིགས་ཀྱི་བུ་གང་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་མདོ་སྡེ་འདི་ལྟ་བུ་འདི་འཛིན་པ་དང་། གཞན་དག་ལ་རྒྱ་ཆེར་སྟོན་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ནི་ཆོས་བརྒྱད་པོ་འདི་དག་དང་ལྡན་པར་འགྱུར་རོ། །
en: Noble son, the bodhisattvas who uphold such a sūtra after the Thus-Gone One’s passing, and who fully teach it to others, will be endowed with those eight qualities.”

source: དེ་ནས་དེའི་ཚེ་སངས་རྒྱས་ཀྱི་མཐུས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་པར་གྱུར་ཏོ། །
en: Then, through the power of the Buddha, this great trichiliocosm shook in six ways,

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་གང་དག་ས་ཕྱོགས་མཐོན་དམན་ཅན་དང་། རི་ནག་པོ་དང་། ཆུ་མིག་དང་། མཚོ་དང་། ལྟེང་ཀ་དང་། རྒྱ་མཚོ་ཆེན་པོ་དེ་དག་ཐམས་ཅད་མི་སྣང་བར་གྱུར་ཏོ། །
en: all the higher and lower regions, the black mountains, and all springs, lakes, ponds, and oceans disappeared, and

source: ས་ཆེན་པོ་འདི་ཐམས་ཅད་ཀྱང་ལག་མཐིལ་ལྟར་མཉམ་པར་གནས་པར་གྱུར་ཏོ། །
en: this entire earth became flat like the palm of the hand.

source: ཆུ་ན་གནས་པའི་སེམས་ཅན་རྣམས་ལ་ཡང་གནོད་པ་མེད་པར་གྱུར་ཏོ། །
en: Still, all the beings living in the water remained unharmed.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་ཤིང་སྐམ་གང་དག་ལོ་བརྒྱ་ལོན་པ་དེ་དག་ཐམས་ཅད་ལས་ཀྱང་མེ་ཏོག་དང་། འབྲས་བུ་སྣ་ཚོགས་སྐྱེས་པར་གྱུར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་བཏུད་མངོན་པར་བཏུད་ནས་ཕྱག་འཚལ་བར་གྱུར་ཏོ། །
en: Also, throughout this great trichiliocosm all the trees that had withered centuries before started to bloom and bear various fruits. These trees then bent in the direction of the Blessed One and paid homage to him.

source: དེ་མ་ཡིན་པ་ཤིང་གཞན་ཐམས་ཅད་ལས་ཀྱང་མེ་ཏོག་དང་འབྲས་བུ་སྣ་ཚོགས་སྐྱེས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་བཏུད་མངོན་པར་བཏུད་ནས་ཕྱག་འཚལ་བར་གྱུར་ཏོ། །
en: All of the other trees also started to bloom and bear various fruits, before bending in the direction of the Blessed One and paying homage to him.

source: ས་ཆེན་པོ་ལས་པད་མ་ཚད་ཤིང་རྟའི་འཁོར་ལོ་ཙམ་སྣ་ཚོགས་བལྟ་ན་སྡུག་པ་ཁ་དོག་དང་ལྡན་པ་དྲི་དང་ལྡན་པ་ཡིད་དུ་འོང་བ་སྐྱེས་སོ། །
en: Bright, lovely, colorful, fragrant, and delightful lotuses the size of chariot wheels sprang up from the earth, and

source: སྣང་བ་ཆེན་པོས་ཀྱང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་གསལ་བར་གྱུར་ཏོ། །
en: a dazzling light illuminated this great trichiliocosm.

source: མི་སྣང་ཞིང་མ་དཀྲོལ་བར་སྟེང་གི་བར་སྣང་ལས་ལྷའི་སིལ་སྙན་དང་། གླུ་དབྱངས་ཀྱི་སྒྲ་བྱུང་སྟེ་གྲགས་པར་གྱུར་ཏོ། །
en: Without anyone being seen or anything being played, divine music and singing were heard from the sky.

source: རིའི་རྒྱལ་པོ་གངས་ཅན་དང་། རིའི་རྒྱལ་པོ་སྤོས་ཀྱི་ངད་ལྡང་ལས་ཀྱང་ལྷའི་མེ་ཏོག་སྣ་ཚོགས་སྔོན་དྲི་མི་མནམ་པ་རྣམས་ཀྱང་མཆོག་གི་དྲི་ལངས་པར་གྱུར་ཏེ
en: Colorful divine flowers that emanated the most delicious fragrances, which had never been experienced before, now appeared on the majestic Himavat mountains as well as on the majestic Mount Gandhamādana, and

source: དྲི་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་དྲི་ཞིམ་པོ་བསྣམ་པར་གྱུར་ཏོ། །
en: their sweet fragrances spread throughout this great trichiliocosm.

source: རིའི་རྒྱལ་པོ་གངས་ཅན་དང་། རིའི་རྒྱལ་པོ་སྤོས་ཀྱི་ངད་ལྡང་དེ་ལས་མེ་ཏོག་གི་ཆར་ཆེན་པོ་བབ་སྟེ། དེ་དག་བཅོམ་ལྡན་འདས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་གང་ན་བ་དེར་མངོན་པར་བབས་ནས་ས་ཆེན་པོ་འདིར་མེ་ཏོག་གི་ཆར་དེ་དག་གིས་པུས་མོ་མན་ཅད་ནུབ་པར་གྱུར་ཏོ། །
en: A great rain of flowers then fell from the majestic Himavat mountains and from the majestic Mount Gandhamādana onto the retinue of the Blessed One, covering the earth up to their knees.

source: མེ་ཏོག་གི་ཤིང་དེ་དག་ལས་མེ་ཏོག་སྣ་ཚོགས་ཀྱི་ཆར་རབ་ཏུ་འབབ་ཅིང་། སིལ་སྙན་དང་། གླུ་དབྱངས་སྣ་ཚོགས་ཀྱི་སྒྲ་དག་ཀྱང་བྱུང་ངོ་། །
en: Rains of various types of flowers fell from the blooming trees and the sounds of music and song resounded all around.

source: སྟེང་གི་བར་སྣང་ལ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་གདུགས་དཔག་ཚད་བརྒྱ་སྟོང་ཕྲག་བཅུའི་ཚད་ཙམ་ཀུན་དུ་གནས་པར་གྱུར་ཏོ། །
en: A parasol made of all kinds of precious gems and measuring about a million leagues covered the sky.

source: རིན་པོ་ཆེའི་གདུགས་དེ་ལས་མུ་ཏིག་གི་དོ་ཤལ་དང་། རིན་པོ་ཆེའི་དྲིལ་བུ་གཡེར་ཀའི་དྲིལ་བུ་སྣ་ཚོགས་ཀྱི་དྲ་བ་འཕྱང་བར་གྱུར་ཏོ། །
en: Pearl garlands and lattices formed by different types of small precious bells were hanging from that bejeweled parasol.

source: དྲིལ་བུ་གཡེར་ཀའི་དྲ་བའི་སྒྲ་ཡིད་དུ་འོང་བ། ཡིད་དགའ་བར་བྱེད་པ། ཆགས་པར་བྱེད་པ་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་གོ་བར་བྱས་པར་གྱུར་ཏོ། །
en: The small bells rang out with the most delightful, enthralling, and enrapturing sounds that pervade this great trichiliocosm.
